test/fixtures/vcr_cassettes/transaction/search.yml

---
http_interactions:
- request:
    method: get
    uri: http://api.regalii.dev/transactions?q%5Bid_eq%5D=1
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - application/vnd.regalii.v3.0+json
      User-Agent:
      - Regaliator gem v3.0.0
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Mar 2016 20:52:13 GMT
      Authorization:
      - APIAuth api-key:WL6G79M838Zoo5LH+jpJsHJ3S04=
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      X-Pagination:
      - '{"total_entries":1,"total_pages":1,"previous_page":null,"current_page":1,"next_page":null}'
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - '"0dd2c5083f4e41a311a14206e6a70f28"'
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 38c0073e-4106-43a4-8705-32eb1483de24
      X-Runtime:
      - '0.213259'
      Vary:
      - Origin
      Date:
      - Tue, 22 Mar 2016 20:52:16 GMT
      Connection:
      - close
    body:
      encoding: UTF-8
      string: '{"transactions":[{"id":1,"external_id":"1-1591-2222222233-201509302128","biller_id":1591,"account_number":"2222222233","bill_amount":2.0,"bill_amount_currency":"USD","fx_rate":16.6048,"bill_amount_usd":2.0,"bill_amount_chain_currency":2.0,"payment_transaction_fee":0.0,"payment_total_usd":2.0,"payment_total_chain_currency":2.0,"chain_earned":0.5,"chain_paid":1.5,"starting_balance":-602.1,"ending_balance":-603.6,"hours_to_fulfill":0,"discount":0.0,"sms_text":null,"created_at":"2015-09-30T21:28:08Z","payment_status":"sent","bill_amount_local_currency":20.0,"local_currency":"MXN"}]}'
    http_version:
  recorded_at: Tue, 22 Mar 2016 20:52:16 GMT
recorded_with: VCR 2.9.3
