test/fixtures/vcr_cassettes/v30/transaction/list.yml

---
http_interactions:
- request:
    method: get
    uri: http://api.regalii.dev/transactions
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - application/vnd.regalii.v3.0+json
      User-Agent:
      - Regaliator gem v3.0.0
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Mar 2016 20:00:30 GMT
      Authorization:
      - APIAuth api-key:cMleQmzTkTfzVlT/D8ueDcL3E88=
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      X-Pagination:
      - '{"total_entries":11,"total_pages":1,"previous_page":null,"current_page":1,"next_page":null}'
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - '"b9b2cb7d7ca22ba6c4178463069e7eac"'
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 6010ee23-10b6-466a-a177-1349366c8fa2
      X-Runtime:
      - '0.100741'
      Vary:
      - Origin
      Date:
      - Tue, 22 Mar 2016 20:00:30 GMT
      Connection:
      - close
    body:
      encoding: UTF-8
      string: '{"transactions":[{"id":1,"external_id":"1-1591-2222222233-201509302128","biller_id":1591,"account_number":"2222222233","bill_amount":2.0,"bill_amount_currency":"USD","fx_rate":16.6048,"bill_amount_usd":2.0,"bill_amount_chain_currency":2.0,"payment_transaction_fee":0.0,"payment_total_usd":2.0,"payment_total_chain_currency":2.0,"chain_earned":0.5,"chain_paid":1.5,"starting_balance":-602.1,"ending_balance":-603.6,"hours_to_fulfill":0,"discount":0.0,"sms_text":null,"created_at":"2015-09-30T21:28:08Z","payment_status":"sent","bill_amount_local_currency":20.0,"local_currency":"MXN"}]}'
    http_version:
  recorded_at: Tue, 22 Mar 2016 20:00:30 GMT
recorded_with: VCR 2.9.3
